SET NAMES UTF8;

DROP DATABASE IF EXISTS STUDENTS;
CREATE DATABASE STUDENTS  CHARACTER SET UTF8 COLLATE UTF8_GENERAL_CI;
USE STUDENTS;

DROP TABLE IF EXISTS SUB_FACULTY;
DROP TABLE IF EXISTS PROFESSION;
DROP TABLE IF EXISTS GROUP_ST;
DROP TABLE IF EXISTS LECTURER;
DROP TABLE IF EXISTS ENTERPRISE;
DROP TABLE IF EXISTS REPRESENTATIVE;
DROP TABLE IF EXISTS STUDENT;
DROP TABLE IF EXISTS RELATIVE;
DROP TABLE IF EXISTS ABROAD;
DROP TABLE IF EXISTS VAR_ASSIGNMENT;
DROP TABLE IF EXISTS ASSIGNMENT;
DROP TABLE IF EXISTS PAYMENT;

CREATE TABLE SUB_FACULTY (
	ID INT,
	NOMER INT,
	NAME VARCHAR(100)
);

INSERT INTO SUB_FACULTY
(ID, NOMER, NAME)
VALUES
(100,43,'КАФЕДРА "СТРАТЕГИЧЕСКИЕ ИНФОРМАЦИОННЫЕ ИССЛЕДОВАНИЯ"'),
(101,12,'КАФЕДРА "КОМПЬЮТЕРНЫЕ СИСТЕМЫ И ТЕХНОЛОГИИ"'),
(102,1,'КАФЕДРА "БИОФИЗИКА, РАДИАЦИОННАЯ ФИЗИКА И ЭКОЛОГИЯ"'),
(103,2,'КАФЕДРА АВТОМАТИКИ');

CREATE TABLE PROFESSION (
	ID INT,
	NOMER INT,
	NAME VARCHAR(100),
	SUB_FAC_ID INT
);

INSERT INTO PROFESSION
(ID, NOMER, NAME, SUB_FAC_ID)
VALUES
(100,200600,'ЭЛЕКТРОНИКА И АВТОМАТИКА ФИЗИЧЕСКИХ УСТАНОВОК',103),
(101,70400,'ФИЗИКА ПУЧКОВ ЗАРЯЖЕННЫХ ЧАСТИЦ И УСКОРИТЕЛЬНАЯ ТЕХНИКА',103),
(102,75400,'КОМПЛЕКСНАЯ ЗАЩИТА ОБЪЕКТОВ ИНФОРМАЦИИ',100),
(103,75500,'КОМПЛЕКСНОЕ ОБЕСПЕЧЕНИЕ ИНФОРМАЦИОННОЙ БЕЗОПАСНОСТИ АВТОМАТИЗИРОВАННЫХ СИСТЕМ',100),
(104,10200,'ПРИКЛАДНАЯ МАТЕМАТИКА И ИНФОРМАТИКА',101),
(105,73000,'ПРИКЛАДНАЯ МАТЕМАТИКА',101),
(106,220100,'ВЫЧИСЛИТЕЛЬНЫЕ МАШИНЫ, КОМПЛЕКСЫ, СИСТЕМЫ И СЕТИ',101),
(107,220200,'АВТОМАТИЗИРОВАННЫЕ СИСТЕМЫ ОБРАБОТКИ ИНФОРМАЦИИ И УПРАВЛЕНИЯ',101),
(108,10200,'ПРИКЛАДНАЯ МАТЕМАТИКА И ИНФОРМАТИКА',102),
(109,14000,'МЕДИЦИНСКАЯ ФИЗИКА',102),
(110,14300,'ФИЗИКА ЗЕМЛИ И ПЛАНЕТ',102),
(111,72600,'ФИЗИКА КОНДЕНСИРОВАННОГО СОСТОЯНИЯ ВЕЩЕСТВА',102),
(112,72700,'ФИЗИКА АТОМНОГО ЯДРА И ЧАСТИЦ',102),
(113,330300,'РАДИАЦИОННАЯ БЕЗОПАСНОСТЬ ЧЕЛОВЕКА И ОКРУЖАЮЩЕЙ СРЕДЫ',102);

CREATE TABLE GROUP_ST (
	ID INT,
	NOMER VARCHAR(10),
	SUB_FAC_ID INT
);

INSERT INTO GROUP_ST
(ID, NOMER, SUB_FAC_ID)
VALUES
(100,'Б8-01',100),
(101,'Б8-02',100),
(102,'Б8-03',100),
(103,'К8-122',101),
(104,'К8-121',101),
(105,'К8-123',101),
(106,'К8-124',101),
(107,'Т8-07',102),
(108,'Т8-11',102),
(109,'Т8-12',102),
(110,'А8-01',103),
(111,'А8-02',103);

CREATE TABLE STUDENT (
	ID INT,
	SURNAME VARCHAR(100),
	NAME VARCHAR(100),
	SEX CHAR(1) DEFAULT NULL,
	BIRTHDAY DATE DEFAULT NULL,
	NATIONALITY VARCHAR(100),
	ADDRESS VARCHAR(255),
	MARK FLOAT,
	GROUP_ID INT
);

INSERT INTO STUDENT
(ID,SURNAME,NAME,SEX,BIRTHDAY,NATIONALITY,ADDRESS,MARK,GROUP_ID)
VALUES
(100,'ПЕТРОВ','АЛЕКСЕЙ','M','1992-03-04','РУССКИЙ','УЛ.ХЛОБЫСТОВА, Д.9, КВ.43','4.5',100),
(101,'ПУПКИН','АНДРЕЙ','M','1992-03-04','РУССКИЙ','УЛ.ГОРЬКОГО, Д.1, КВ.4','4.9',100),
(102,'СИДОРОВ','ИЛЬЯ','M','1992-03-04','РУССКИЙ','УЛ.КОСЯКОВА, Д.2, КВ.1','3.01',100),
(103,'АЛИЕВ','АЛЕКСАНДР','M','1992-03-04','ГРУЗИН','УЛ.ДАЧНАЯ, Д.13, КВ.12','3.5',101),
(104,'ИВАНОВ','ИВАН','M','1992-03-04','РУССКИЙ','УЛ.ГОГОЛЯ, Д.15, КВ.110','3.89',101),
(105,'ЛЕВИН','ДМИТРИЙ','M','1992-03-04','РУССКИЙ','УЛ.ЗЕЛЕНАЯ, Д.11, КВ.11','3.67',101),
(106,'ОГНЕВ','ЕВГЕНИЙ','M','1992-03-04','РУССКИЙ','УЛ.КАЛИНИНА, Д.16, КВ.1','3.34',102),
(107,'ПАВЛОВА','АННА','F','1992-03-04','РУССКАЯ','УЛ.КАЗИНСКАЯ, Д.4, КВ.23','4.8',102),
(108,'ГЛОТОВА','ОЛЬГА','F','1992-03-04','РУССКАЯ','УЛ.ИКШИНСКАЯ, Д.10, КВ.3','3.31',102),
(109,'СОСНОВА','МАРИЯ','F','1992-03-04','РУССКАЯ','ЮРЛОВСКИЙ ПР, Д.1А, КВ.15','3.92',103),
(110,'ШАРАФУТДИНОВ','СЕРГЕЙ','M','1992-03-04','РУССКИЙ','УЛ.ЯГОДНАЯ, Д.12, КВ.99','4.47',103),
(111,'КОПЫЛОВ','СЕРГЕЙ','M','1992-03-04','РУССКИЙ','УЛ.ГРИНА, Д.8, КВ.45','4.51',103),
(112,'БАЖЕНОВА','АННА','F','1992-03-04','РУССКАЯ','УЛ.ЭЛЕВАТОРНАЯ, Д.17, КВ.5','3.15',104),
(113,'КОЗЛОВ','ИГОРЬ','M','1992-03-04','ПОЛЯК','ЛУКОВ ПЕР., Д.8, КВ.75','4.06',104),
(114,'КУДАШЕВ','АЛЕКСЕЙ','M','1992-03-04','РУССКИЙ','УЛ.ДАЛЬНЯЯ, Д.3, КВ.45','4.78',104),
(115,'КАЗАРИНА','АННА','F','1992-03-04','РУССКАЯ','УЛ.ДОВЖЕНКО, Д.32, КВ.4','3.25',105),
(116,'СЕЧИН','АЛЕКСЕЙ','M','1992-03-04','РУССКИЙ','УЛ.ЗАБЕЛИНА, Д.14, КВ.42','5',105),
(117,'ЛАКТАНОВА','ОЛЬГА','F','1992-03-04','РУССКАЯ','УЛ.ЗОНАЛЬНАЯ, Д.22, КВ.15','4.82',106),
(118,'ОБИЩАН','КСЕНИЯ','F','1992-03-04','РУССКАЯ','УЛ.РАЕВСКОГО, Д.1, КВ.78','3.45',106),
(119,'БОЛДЫРЕВ','АЛЕКСАНДР','M','1992-03-04','РУССКИЙ','УЛ.РОТЕРТА, Д.2, КВ.65','3.19',107),
(120,'ЧИЖОВ','МАКСИМ','M','1992-03-04','РУССКИЙ','РЫБНЫЙ ПЕР., Д.2, КВ.16','4.48',107),
(121,'ЧИГАРЕВА','ИРИНА','F','1992-03-04','РУССКАЯ','УЛ.ЖИГУЛЕВСКАЯ, Д.24, КВ.10','4.54',108),
(122,'ВОРОНЦОВА','ЕКАТЕРИНА','F','1992-03-04','РУССКАЯ','УЛ.ОБРУЧЕВА, Д.11, КВ.85','4.96',108),
(123,'ИЗМАЙЛОВ','ВЛАДИМИР','M','1992-03-04','РУССКИЙ','ОРЕХОВЫЙ ПР., Д.15, КВ.34','3.4',109),
(124,'ХОРИН','ОЛЕГ','M','1992-03-04','РУССКИЙ','УЛ.ОТРАДНАЯ, Д.21, КВ.2','3.8',109),
(125,'БАБАЙЛОВА','НИНА','F','1992-03-04','РУССКАЯ','УЛ.ФЕДОРОВА, Д.19, КВ.64','4.33',109),
(126,'ХАРИТОНОВ','ПАВЕЛ','M','1992-03-04','РУССКИЙ','УЛ.ФОНВИЗИНА, Д.18, КВ.14','4.44',109),
(127,'ВОРОБЬЕВ','ДМИТРИЙ','M','1992-03-04','РУССКИЙ','ТАРНЫЙ ПР., Д.2, КВ.278','3.66',110),
(128,'ЛИМОНОВ','ЛЕОНИД','M','1992-03-04','РУССКИЙ','УЛ.ТОЛБУХИНА,Д.5,КВ.33','3.9',110),
(129,'ПЕЧКИНА','ОКСАНА','F','1992-03-04','РУССКАЯ','УЛ.ТУШИНСКАЯ,Д.6,КВ.49','4.02',111),
(130,'ЯШИН','СЕРГЕЙ','М','1992-03-04','РУССКИЙ','УЛ.БАЖОВА,Д.7,КВ.75','4.59',111);

CREATE TABLE RELATIVE (
	ID INT,
	SURNAME VARCHAR(100),
	NAME VARCHAR(100),
	RODSTVO VARCHAR(100),
	ADDRESS VARCHAR(255),
	WORK_PLACE VARCHAR(255),
	JOB VARCHAR(100),
	STUD_ID INT
);

INSERT INTO RELATIVE
(ID,SURNAME,NAME,RODSTVO,ADDRESS,WORK_PLACE,JOB,STUD_ID)
VALUES
(100,'ПЕТРОВ','ИГОРЬ','ОТЕЦ','УЛ.ХЛОБЫСТОВА, Д.9, КВ.43',NULL,NULL,100),
(101,'ПЕТРОВА','ЕЛЕНА','МАТЬ','УЛ.ХЛОБЫСТОВА, Д.9, КВ.43',NULL,NULL,100),
(102,'ПЕТРОВ','РОМАН','БРАТ','УЛ.ХЛОБЫСТОВА, Д.9, КВ.43',NULL,NULL,100),
(103,'ПУПКИН','КИРИЛЛ','ОТЕЦ','УЛ.6 ПАРКОВАЯ, Д.11, КВ.7','ЗАО СВЯЗЬСТРОЙСЕРВИС',NULL,101),
(104,'ПУПКИНА','МАРИНА','МАТЬ','УЛ.6 ПАРКОВАЯ, Д.11, КВ.7',NULL,NULL,101),
(105,'ИВАНОВ','ИВАН','ОТЕЦ','УЛ.ЦАНДЕРА, Д.23, КВ.3','В/Ч 19674','ВОЕННОСЛУЖАЩИЙ',104),
(106,'ИВАНОВА','ИРИНА','МАТЬ','УЛ.ЦАНДЕРА, Д.23, КВ.3','В/Ч 19674','ВОЕННОСЛУЖАЩАЯ',104),
(107,'ПАВЛОВ','ЛЕОНИД','ОТЕЦ','УЛ.КАЗИНСКАЯ, Д.4, КВ.23','МГУ','ДЕКАН',107),
(108,'ПАВЛОВА','МАРИЯ','МАТЬ','УЛ.КАЗИНСКАЯ, Д.4, КВ.23',NULL,NULL,107),
(109,'ШАРАФУТДИНОВ','НИКОЛАЙ','ОТЕЦ','УЛ.ЯГОДНАЯ, Д.12, КВ.99','ЦБ РОССИИ',NULL,110),
(110,'ШАРАФУТДИНОВА','ВЕРА','МАТЬ','УЛ.ЯГОДНАЯ, Д.12, КВ.99','МСЧ','МЕДСЕСТРА',110),
(111,'ШАРАФУТДИНОВА','АНАСТАСИЯ','СЕСТРА','УЛ.ЯГОДНАЯ, Д.12, КВ.99','ШКОЛА №345','УЧЕНИЦА 7КЛАССА',110),
(112,'ШАРАФУТДИНОВ','ЕВГЕНИЙ','БРАТ','УЛ.ЯГОДНАЯ, Д.12, КВ.99','МАДИ','СТУДЕНТ',110),
(113,'КУДАШЕВА','АЛЕКСАНДРА','ЖЕНА','УЛ.ПАЛИХА, Д.32, КВ.254',NULL,NULL,114),
(114,'КАЗАРИН','СЕРГЕЙ','ОТЕЦ','УЛ.ДОВЖЕНКО, Д.32, КВ.4','РАЙОННАЯ БОЛЬНИЦА №12','ГЛАВВРАЧ',115),
(115,'ЛАКТАНОВ','ИГОРЬ','ОТЕЦ','УЛ.ЗОНАЛЬНАЯ, Д.22, КВ.15',NULL,NULL,117),
(116,'ЛАКТАНОВА','ЕВГЕНИЯ','МАТЬ','УЛ.ЗОНАЛЬНАЯ, Д.22, КВ.15',NULL,NULL,117),
(117,'БОЛДЫРЕВА','НАТАЛЬЯ','МАТЬ','УЛ.РОТЕРТА, Д.2, КВ.65','ОАО ГРУЗОПЕРЕВОЗКИ""','ОПЕРАТОР ПК',119),
(118,'ВОРОНЦОВ','КИРИЛЛ','ОТЕЦ','УЛ.ОБРУЧЕВА, Д.11, КВ.85',NULL,NULL,122),
(119,'ИЗМАЙЛОВ','ПЕТР','ОТЕЦ','ОРЕХОВЫЙ ПР., Д.15, КВ.34',NULL,NULL,123),
(120,'ИЗМАЙЛОВА','ОКСАНА','МАТЬ','ОРЕХОВЫЙ ПР., Д.15, КВ.34',NULL,NULL,123),
(121,'БАБАЙЛОВ','ИВАН','ОТЕЦ','УЛ.ФЕДОРОВА, Д.19, КВ.64',NULL,NULL,125),
(122,'БАБАЙЛОВ','ОЛЕГ','БРАТ','УЛ.ФЕДОРОВА, Д.19, КВ.64',NULL,NULL,125),
(123,'ХАРИТОНОВ','АНАТОЛИЙ','ОТЕЦ','УЛ.ФОНВИЗИНА, Д.18, КВ.14','ШКОЛА №756','УЧИТЕЛЬ',126);

CREATE TABLE ABROAD (
	ID INT,
	DATA VARCHAR(8),
	COUNTRY VARCHAR(100),
	REL_ID INT
);

INSERT INTO ABROAD
(ID, DATA, COUNTRY, REL_ID)
VALUES
(100,'12.04.99','ПОЛЬША',108),
(101,'12.04.99','ПОЛЬША',109),
(102,'03.11.01','ФРАНЦИЯ',114),
(103,'14.01.93','США',120),
(104,'14.01.93','США',121),
(105,'05.07.02','ИСПАНИЯ',123);

CREATE TABLE LECTURER (
	ID INT,
	SURNAME VARCHAR(100),
	NAME VARCHAR(100),
	SUB_FAC_ID INT
);

INSERT INTO LECTURER
(ID, SURNAME, NAME, SUB_FAC_ID)
VALUES
(100,'ЗАЙЦЕВ','МИХАИЛ',100),
(101,'ВАСИЛЬЕВ','НИКОЛАЙ',101),
(102,'ЛЕВКИН','ФЕДОР',102),
(103,'ЗУБОВ','РОМАН',103);

CREATE TABLE ENTERPRISE (
	ID INT,
	NAME VARCHAR(100),
	ADDRESS VARCHAR(255)
);

INSERT INTO ENTERPRISE
(ID, NAME, ADDRESS)
VALUES
(100,'МОСКОМ','УЛ.ПАПАНИНА,34'),
(101,'ЛАНИТ','УЛ.САВЕЛЬЕВА,15'),
(102,'ОКБ САПР','УЛ.САМАРИНСКАЯ,1/А'),
(103,'ЦБ РОССИИ','УГЛОВОЙ ПЕР.,3'),
(104,'НИИ "КВАНТ"','УЛ.ГОГОЛЯ,4'),
(105,'ЛАБОРАТОРИЯ КАСПЕРСКОГО','УЛ.ИБРАГИМОВА,22'),
(106,'БИЛАЙН','ИЗВИЛИСТЫЙ ПР.,12'),
(107,'МЕГАФОН','УЛ.МАКЕЕВСКАЯ,5'),
(108,'МТС','УЛ.НАРОДНАЯ,10'),
(109,'НИИ "ГИДРОПРОЕКТ"','УЛ.БОГДАНОВА,2'),
(110,'ОАО "АЗБУКА МОРЗЕ"','УЛ.ВЕЕРНАЯ,31');

CREATE TABLE REPRESENTATIVE (
	ID INT,
	SURNAME VARCHAR(100),
	NAME VARCHAR(100),
	JOB VARCHAR(100),
	ENT_ID INT
);

INSERT INTO REPRESENTATIVE
(ID, SURNAME, NAME, JOB, ENT_ID)
VALUES
(100,'КУЛАКОВ','ПЕТР',NULL,100),
(101,'ЛЕОНОВ','ВАСИЛИЙ',NULL,101),
(102,'ЛОХМАЕВ','РОМАН',NULL,102),
(103,'БЫКАДОРОВ','ИГОРЬ',NULL,103),
(104,'СЕМЕНОВ','ЕВГЕНИЙ',NULL,103),
(105,'ЗАБЕЛИН','ДМИТРИЙ',NULL,104),
(106,'ХОДЬКО','АЛЕКСЕЙ',NULL,105),
(107,'ДЕМИН','ПЕТР',NULL,106),
(108,'ФИЛАРЕТОВ','МИХАИЛ',NULL,107),
(109,'СТОИН','ВЛАДИМИР',NULL,108),
(110,'МИНАЕВ','СЕМЕН',NULL,110);

CREATE TABLE VAR_ASSIGNMENT (
	ID INT,
	DATA_TALK VARCHAR(8),
	STUD_ID INT,
	REPRES_ID INT,
	LECT_ID INT,
	ENT_ID INT
);

INSERT INTO VAR_ASSIGNMENT
(ID, DATA_TALK, STUD_ID, REPRES_ID, LECT_ID, ENT_ID)
VALUES
(100,'13.12.04',100,101,100,101),
(101,'19.12.04',100,102,100,102),
(102,'01.11.04',100,105,100,105),
(103,'07.12.04',103,104,100,104),
(104,'28.10.04',103,109,100,109),
(105,'25.11.04',104,110,100,110),
(106,'14.11.04',105,101,100,101),
(107,'14.12.04',105,110,100,110),
(108,'22.10.04',110,104,101,104),
(109,'15.12.04',110,106,101,106),
(110,'16.12.04',110,107,101,107),
(111,'17.11.04',110,108,101,108),
(112,'18.10.04',115,105,101,105),
(113,'27.11.04',115,110,101,110),
(114,'09.11.04',115,107,101,107),
(115,'10.12.04',120,100,102,100),
(116,'15.01.05',120,101,102,101),
(117,'25.10.04',121,109,102,109),
(118,'23.12.04',122,103,102,103),
(119,'16.01.05',129,106,103,106),
(120,'11.12.04',129,108,103,108),
(121,'11.11.04',130,107,103,107),
(122,'04.12.04',130,108,103,108);

CREATE TABLE ASSIGNMENT (
	ID INT,
	DATA_CONTR VARCHAR(8),
	DATA_WORK VARCHAR(8),
	VAR_ASSIG_ID INT
);

INSERT INTO ASSIGNMENT
(ID, DATA_CONTR, DATA_WORK, VAR_ASSIG_ID)
VALUES
(100,'15.01.05','01.04.05',100),
(101,'25.02.05','15.04.05',103),
(102,'10.02.05','11.04.05',105),
(103,'09.03.05','18.04.05',107),
(104,'17.02.05','29.05.05',109),
(105,'14.02.05','30.04.05',112),
(106,'26.01.05','01.05.05',115),
(107,'31.03.05','13.04.05',117),
(108,'19.03.05','03.05.05',118),
(109,'22.02.05','12.04.05',120),
(110,'03.03.05','08.04.05',121);

CREATE TABLE PAYMENT (
	ID INT,
	DATA VARCHAR(8),
	SUMMA INT,
	ASSIG_ID INT
);

INSERT INTO PAYMENT
(ID, DATA, SUMMA, ASSIG_ID)
VALUES
(100,'12.02.05',2000,100),
(101,'01.02.05',3000,103),
(102,'13.02.05',1500,104),
(103,'15.02.05',1000,106),
(104,'10.03.05',3500,109),
(105,'28.02.05',2000,110);